"AU BECS Direct Debit" = "AU BECS-Lastschriftverfahren";

"Affirm" = "Affirm";

"Afterpay" = "Afterpay";

"Alipay" = "Alipay";

"BLIK" = "BLIK";

"Bancontact" = "Bancontact";

"Bank" = "Bank";

"Boleto" = "Boleto";

"Card" = "Karte";

"Cash App Pay" = "Cash App Pay";

"Clearpay" = "Clearpay";

"EPS" = "EPS";

"FPX" = "FPX";

"GrabPay" = "GrabPay";

"Klarna" = "Klarna";

"Link" = "Link";

"NetBanking" = "NetBanking";

"OXXO" = "OXXO";

"PayPal" = "PayPal";

"Przelewy24" = "Przelewy24";

"SEPA Debit" = "SEPA-Lastschrift";

"Sofort" = "Sofort";

"Timed out authenticating your payment method -- try again" = "Zeitüberschreitung bei der Authentifizierung Ihrer Zahlungsmethode – versuchen Sie es noch einmal.";

"UPI" = "UPI";

"US Bank Account" = "US-Bankkonto";

"Unknown" = "Unbekannt";

"We are unable to authenticate your payment method. Please choose a different payment method and try again." = "Wir können Ihre Zahlungsmethode nicht authentifizieren. Bitte wählen Sie eine andere Zahlungsmethode und versuchen Sie es noch einmal.";

"WeChat Pay" = "WeChat Pay";

"giropay" = "Giropay";

"iDEAL" = "iDEAL";
